{"translation-revision-date":"YEAR-MO-DA HO:MI+ZONE","generator":"WP-CLI\/2.11.0","source":"blocks\/build\/cookie-banner\/index.js","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","lang":"en","plural-forms":"nplurals=2; plural=(n != 1);"},"Cookie Settings":[""],"Bottom":[""],"Top":[""],"Center":[""],"Bottom Right":[""],"Bottom Left":[""],"Top Right":[""],"Top Left":[""],"Opt-in (Explicit Consent)":[""],"Opt-out (Implied Consent)":[""],"Notice Only":[""],"Deemed Consent":[""],"Implied Consent":[""],"Visibility":[""],"General":[""],"Cookie Categories":[""],"Appearance":[""],"Advanced":[""],"Restrictions":[""],"Compliance":[""],"Banner Visibility":[""],"Show Banner":[""],"Toggle to show or minimize the banner. When hidden, it will be minimized to the bottom of the page.":[""],"Note: This setting only affects the editor preview and frontend display. The banner will still be functional when minimized, and users can access it via the floating button.":[""],"Banner Content":[""],"Banner Title":[""],"Banner Description":[""],"Privacy Policy Link":[""],"Enter the URL to your Privacy Policy page":[""],"Privacy Policy Text":[""],"Privacy Policy Version":[""],"Optional: Set a version identifier (like a date) to track policy changes":[""],"Terms Link":[""],"Enter the URL to your Terms of Service page":[""],"Terms Text":[""],"Terms Version":[""],"Optional: Set a version identifier (like a date) to track terms changes":[""],"Check for Version Changes":[""],"When enabled, users will be asked to re-consent when your privacy policy or terms change":[""],"Button Labels":[""],"Accept All Text":[""],"Reject All Text":[""],"Customize Text":[""],"Save Preferences Text":[""],"Cookie Types Configuration":[""],"Enable or disable different cookie categories. Note that necessary cookies cannot be disabled.":[""],"Functional Cookies":[""],"Analytical Cookies":[""],"Advertising Cookies":[""],"Tracking Cookies":[""],"Necessary Cookies":[""],"Title":[""],"Description":[""],"Necessary cookies are always enabled and cannot be rejected.":[""],"Layout Settings":[""],"Banner Position":[""],"Floating Button Position":[""],"Colors":[""],"Primary Color":[""],"Text Color":[""],"Background Color":[""],"Cookie Expiration (days)":[""],"Consent Model":[""],"Select the consent model to use based on your region's legal requirements. This will be overridden by GeoIP detection if enabled.":[""],"Note: The cookie expiration setting may be automatically adjusted based on the visitor's location to comply with local regulations.":[""],"Block Usage Restrictions":[""],"Show Only in Site Editor":[""],"When enabled, this block will only be visible when added to a template in the Site Editor, not in individual posts or pages.":[""],"Regional Compliance":[""],"The banner will automatically adjust to comply with privacy regulations based on the visitor's location.":[""],"Show Do Not Sell Link":[""],"Display a \"Do Not Sell or Share My Personal Information\" link (required for CCPA\/CPRA compliance).":[""],"Do Not Sell Link":[""],"URL to your Do Not Sell or Share My Personal Information page":[""],"Do Not Sell Text":[""],"Note: GeoIP detection will override some of these settings to ensure compliance with local laws.":[""],"This Cookie Banner block is configured to only be shown when used in the Site Editor. It will not be visible on individual posts or pages.":[""],"Cookie Consent Banner":[""],"Configure the cookie consent banner settings in the sidebar. This block will display a GDPR compliant cookie consent banner on the frontend of your site.":[""],"Banner minimized. Toggle visibility in block settings.":[""],"This block has a preview in the editor but will adapt to the visitor's location on the frontend.":[""],"Banner is minimized. Users can still access settings via the floating button.":[""],"Learn more about":[""],"GDPR Cookie Compliance":[""]}}}